{
  "catalogPages": [
    {
      "pageNumber": 1,
      "filename": "1-Hyperid Design.tif",
      "category": "Implant Design",
      "title": "Smart Hyperid Body Design",
      "products": [
        {
          "name": "Smart Hyperid - Tappered Form",
          "description": "MGM implant design has a unique smart design that gives our dentists the benefits for the tapered and cylindrical implants design. MGM implant has a Tapered Core body design with conical shape to mimics the natural tooth root.",
          "specifications": [],
          "features": [
            "Better Primary Stability - Especially useful in soft bone or immediate placement",
            "Ideal for Narrow Ridges - Requires less bone width, reducing the need for grafting",
            "Less Pressure on Cortical Bone - Minimizes bone resorption",
            "Easier Insertion Path - Guides itself during placement, helpful in angled or tight spaces",
            "Faster Osseointegration - Because of improved stability and bone contact",
            "Even Stress Distribution - Ideal for dense (Type I/II) bone",
            "More Bone-to-Implant Contact Surface Area - Promotes long-term stability",
            "Simpler Surgical Protocol - Predictable drilling and placement steps",
            "Better for Bone Grafting Cases - Offers stable fit in augmented areas",
            "Useful for Splinted prosthesis - Parallel design helps in multi-unit cases",
            "Straight body with uniform diameter"
          ],
          "partNumbers": [],
          "materials": [],
          "compatibleWith": [],
          "clinicalUses": [
            "Immediate loading cases",
            "Soft bone density (Type III/IV)",
            "Post-extraction sockets",
            "Aesthetic cases (anterior)",
            "Dense bone areas (posterior mandible)",
            "Full arch or splinted cases",
            "Cases with high precision surgical guides",
            "Reconstructive surgeries with bone grafts"
          ]
        },
        {
          "name": "Smart Hyperid - Cylindrical Form",
          "description": "MGM implant has Cylindrical (Parallel-Walled) through the outline of our implants threads to make: Straight body with uniform diameter.",
          "specifications": [],
          "features": [
            "Even Stress Distribution - Ideal for dense (Type I/II) bone",
            "More Bone-to-Implant Contact Surface Area - Promotes long-term stability",
            "Simpler Surgical Protocol - Predictable drilling and placement steps",
            "Better for Bone Grafting Cases - Offers stable fit in augmented areas",
            "Useful for Splinted prosthesis - Parallel design helps in multi-unit cases"
          ],
          "partNumbers": [],
          "materials": [],
          "compatibleWith": [],
          "clinicalUses": [
            "Dense bone areas (posterior mandible)",
            "Full arch or splinted cases",
            "Cases with high precision surgical guides",
            "Reconstructive surgeries with bone grafts"
          ]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 2,
      "filename": "2-smart cervix.tif",
      "category": "Implant Design",
      "title": "Smart Cervix - A Thread-Free Cervical Area",
      "products": [
        {
          "name": "Smart Cervix",
          "description": "MGM implants Smart Cervix plays a critical role in soft tissue integration, hygiene, and crestal bone preservation.",
          "specifications": [],
          "features": [
            "Improved Soft Tissue Adaptation - A smooth surface promotes better attachment of soft tissue (gingiva). Creates a tight seal around the implant, acting as a barrier to bacteria",
            "Reduced Bacterial Accumulation - No threads = fewer micro-irregularities for plaque to attach. Easier to clean and maintain over time (especially beneficial for long-term success). Reduces peri-implantitis risk",
            "Minimizes Crestal Bone Loss - Threads near the crest may cause micro-movement or stress concentration on the marginal bone. A minimally machined neck reduces mechanical irritation to the crestal bone. Especially beneficial in cases with thin biotype or minimal bone height",
            "Better Aesthetic Outcome - In esthetic areas, a smooth collar better supports soft tissue contour and volume. Helps avoid gray shadows or recession due to inflammation or bone loss. Harmonizes better with the gingival line",
            "Ideal for Subcrestal or Equicrestal Placement - Smoothly treated cervical portion can be safely placed at or slightly below bone level without causing inflammatory response. Encourages stable tissue healing"
          ],
          "partNumbers": [],
          "materials": [],
          "compatibleWith": []
        }
      ],
      "additionalInfo": "Key Benefits of Having a Smart Cervix detailed. Page marked as P1"
    },
    {
      "pageNumber": 3,
      "filename": "3-paper thread.tif",
      "category": "Implant Design",
      "title": "Smart Paper Thread Design",
      "products": [
        {
          "name": "Smart Paper Thread Design",
          "description": "MGM implants have smart unique paper thread designs machined in a smart manner to help our dentists to get outstanding results. MGM implants has a smart unique Bone Friendly thread design that cuts inside the bone without distraction which it helps for faster healing processes.",
          "specifications": [],
          "features": [
            "Improvement of Bone Density and Quality through compression and osseodensiﬁcation - Easy to use (especially for new users) of MGM implants thread designs during the insertion",
            "Even Stress Distribution - Minimizes bone loss due damage and resorption",
            "Crestal Bone Preservation - Shallower threads near the top reduce pressure on cortical bone",
            "Self-Condensation in Soft Bone - Threads compress bone rather than cutting it, increasing density and stability",
            "Improves Osseointegration - Maximizes bone-to-implant contact due to thread geometry",
            "Easy and Straightforward Insertion - Self-guiding shape allows precise and safe placement",
            "Ideal for Immediate Placement & Loading - Excellent stability reduces micromovement risks",
            "Versatile in All Bone Types - Performs well in both hard and soft bone—fewer implant types needed",
            "Minimally Invasive Drilling Protocol - Smaller osteotomies required—preserves native bone",
            "Reduces Surgical Time & Complexity - Simplifies clinical workflow, especially in narrow ridges or fresh sockets"
          ],
          "partNumbers": [],
          "materials": [],
          "compatibleWith": [],
          "benefitsForBone": [
            "Improvement of Bone Density and Quality",
            "Even Stress Distribution",
            "Crestal Bone Preservation",
            "Self-Condensation in Soft Bone",
            "Improves Osseointegration"
          ],
          "benefitsForDoctors": [
            "Easy and Straightforward Insertion",
            "Ideal for Immediate Placement & Loading",
            "Versatile in All Bone Types",
            "Minimally Invasive Drilling Protocol",
            "Reduces Surgical Time & Complexity"
          ]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 4,
      "filename": "4-smart apex.tif",
      "category": "Implant Design",
      "title": "Smart Apex - Pointed apex with rounded boundaries",
      "products": [
        {
          "name": "Smart Apex Design",
          "description": "MGM implants has a Smart apical design that Provide alot of benefits for the bone and also for our dentists.",
          "specifications": [],
          "features": [
            "Atraumatic to Vital Structures - Reduces the risk of damaging anatomical areas like the sinus membrane, inferior alveolar nerve, or lingual plate during placement",
            "Less Bone Damage at Insertion - Gentle on trabecular bone, minimizing microfractures and heat buildup during insertion",
            "Enhanced Safety in Immediate Placement - Especially in post-extraction sockets or thin bone walls—minimizes risk of perforation or over-penetration",
            "Directs Bone Healing - Creates a favorable environment for early bone regeneration and vascularization around the apex",
            "Surgical Safety and Confidence - Allows clinician to place implants closer to critical anatomical landmarks with more confidence",
            "Easier Directional Control - During insertion MGM implants smart tip reduces risk of off-axis or penetrating too deeply",
            "Improved Handling in Soft Bone - Facilitates smoother, more controlled insertion without damaging bone",
            "Less risk of sinus floor perforation in transcrestal sinus elevation procedure"
          ],
          "partNumbers": [],
          "materials": [],
          "compatibleWith": [],
          "benefitsForBone": [
            "Atraumatic to Vital Structures",
            "Less Bone Damage at Insertion",
            "Enhanced Safety in Immediate Placement",
            "Directs Bone Healing"
          ],
          "benefitsForDoctors": [
            "Surgical Safety and Confidence",
            "Easier Directional Control",
            "Improved Handling in Soft Bone",
            "Less risk of sinus floor perforation"
          ],
          "clinicalSituations": [
            "Immediate implant placement",
            "Proximity to nerve canals or sinus cavities",
            "Soft bone (Type III/IV)",
            "Narrow or underprepared osteotomies"
          ]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 5,
      "filename": "5-smart connection.tif",
      "category": "Implant Design",
      "title": "Smart Connection",
      "products": [
        {
          "name": "Morse Taper Connection with 11° angle",
          "description": "The Morse taper connection with 11° angle in MGM Implants, is a highly precise internal conical connection used in dental implants. This design has a lot of clinical advantages in both mechanical stability and biological outcomes.",
          "specifications": ["11° angle"],
          "features": [
            "Cold Welding/Micromechanical Stability - Cold welding effect. The 11° angle provides a strong mechanical lock due to the friction fit between abutment and implant, minimizing micromovement. Prevention of screw loosening. Reduced need for abutment screws or lower chance of screw loosening if misfit occurs",
            "Improved Sealing (Bacterial Seal) - The tight seal and mechanical stability lead to reduced inflammatory response and crestal bone loss over time. A better seal means less bacterial infiltration and improved soft tissue adaptation",
            "Balanced Bone Preservation - The conical design distributes occlusal forces more evenly along the implant body. Helps reduce stress concentration at the crestal bone level, preventing early crestal bone loss. Success in long-term esthetic outcomes",
            "Better Force Distribution - The conical design distributes occlusal forces more evenly along the implant body. The 11° angle allows stress to be distributed axially and laterally in a more balanced way. Decreases peak stress at the implant-bone interface",
            "Esthetic and Prosthetic Advantages - Platform shifting effect naturally integrates into Morse taper systems, aiding in soft tissue preservation. Allows for more aesthetic emergence profiles and soft tissue support in the esthetic zone",
            "Proven Long-Term Success - Clinical studies show that Morse taper implants (including 11° types) have excellent survival and low complication rates over the long term"
          ],
          "partNumbers": [],
          "materials": [],
          "compatibleWith": []
        }
      ],
      "additionalInfo": "The main benefits of an 11° Morse taper connection in MGM implants. Page marked as P1"
    },
    {
      "pageNumber": 7,
      "filename": "7-smart surfave.tif",
      "category": "Implant Design",
      "title": "Smart Surface",
      "products": [
        {
          "name": "M Pure Surface Treatment",
          "description": "The MGM Implants' M Pure' surface treatment is a moderately rough surface modification technology designed to enhance osseointegration while maintaining high biocompatibility.",
          "specifications": ["Moderate Surface Roughness", "High Purity / Clean Surface", "Reduced Inflammatory Response", "Faster Healing Than Machined", "Long-Term Stability", "Biocompatible Material Use"],
          "features": [
            "Moderate Surface Roughness - Provides strong primary stability and bone-implant contact",
            "High Purity / Clean Surface - Surface free of embedded particles, improves biocompatibility",
            "Reduced Inflammatory Response - Minimizes risk of peri-implantitis due to lower bacterial adhesion",
            "Faster Healing Than Machined - Implants and More bone apposition than machined surfaces too",
            "Long-Term Stability - Adequate for conventional loading protocols",
            "Biocompatible Material Use - Only titanium or titanium oxide used, no aluminum or acid residues"
          ],
          "partNumbers": [],
          "materials": ["Titanium", "Titanium oxide"],
          "compatibleWith": [],
          "surfaceTreatment": "M Pure Surface - proprietary surface treatment that typically involves: Sandblasting with biocompatible materials (e.g., titanium or oxide). No acid-etching or chemical surface modification (hence 'pure'). A focus on cleanliness, biological safety, and moderate roughness for good bone contact. Final surfaces that are free from chemical residues and contaminants",
          "surfaceMagnifications": ["100X", "5000X", "10000X"]
        }
      ],
      "additionalInfo": "Page includes microscopic surface images at different magnifications. Page marked as P1"
    },
    {
      "pageNumber": 8,
      "filename": "8-Prosthetics.jpg",
      "category": "Prosthetics Options",
      "title": "PROSTHETICS OPTIONS - Introducing Our Orchestrator",
      "products": [],
      "additionalInfo": "Cover page for prosthetics section with artistic image of conductor/orchestrator theme"
    },
    {
      "pageNumber": 9,
      "filename": "9-Prothestitc Cover.tif",
      "category": "Prosthetics Options",
      "title": "PROSTHETICS OPTIONS",
      "products": [],
      "additionalInfo": "Overview page showing prosthetics hierarchy: TEMPORARY (Titanium, Plastic), STOCK (Straight, Angled, Healing), SPECIAL (MUA, Over Denture, Digital Options)"
    },
    {
      "pageNumber": 12,
      "filename": "12-Straight Abut2.tif",
      "category": "Prosthetics Options - Stock Abutments",
      "title": "Straight Abutments - Dimensions Table",
      "products": [
        {
          "name": "Straight Abutment - Yellow (Fixture Ø3.4)",
          "description": "Two piece type abutment. Connect it using 1.2 hexa driver (25N-cm)",
          "specifications": ["Fixture Diameter Ø3.4", "Cuff heights: 1, 2, 3, 4"],
          "features": [],
          "partNumbers": ["MOSHY 4518", "MOSHY 4528", "MOSHY 4538", "MOSHY 4548"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Straight Abutment - Blue (Fixture Ø4.3)",
          "description": "Two piece type abutment. Connect it using 1.2 hexa driver (25N-cm)",
          "specifications": ["Fixture Diameter Ø4.3", "Cuff heights: 1, 2, 3, 4"],
          "features": [],
          "partNumbers": ["MOSHB 5518", "MOSHB 5528", "MOSHB 5538", "MOSHB 5548"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        }
      ],
      "additionalInfo": "Diameter D-Ø4.5 for both fixture sizes. Page marked as P1"
    },
    {
      "pageNumber": 13,
      "filename": "13-Angled Abut.tif",
      "category": "Prosthetics Options - Stock Abutments",
      "title": "Angled Abutments",
      "products": [
        {
          "name": "MGM Angled Abutment",
          "description": "MGM angled abutment is a dental implant component used when the implant is not placed perfectly vertical and needs angulation correction to support a properly aligned crown, bridge, or denture.",
          "specifications": [],
          "features": [
            "Common in anterior maxilla, tilted implants (like in All-on-4 cases), or in full-arch prosthetics",
            "Usually titanium Grade 5 or zirconia",
            "Helps align the prosthesis with the rest of the teeth when the implant is placed at an angle due to anatomical limitations (e.g., sinus, nerves, bone structure)",
            "Typically comes in angles like 15° or 25° to correct for implant misalignment"
          ],
          "partNumbers": [],
          "materials": ["Titanium Grade 5", "Zirconia"],
          "compatibleWith": [],
          "builtInAngles": ["15°", "25°"],
          "whenToUse": [
            "The implant is placed off-axis due to limited bone or anatomical structures",
            "You need to improve the emergence profile or esthetics",
            "You're working with multi-unit restorations and need to achieve a parallel path of insertion"
          ]
        }
      ],
      "additionalInfo": "Key Features of MGM Angled Abutment detailed. Page marked as P1"
    },
    {
      "pageNumber": 14,
      "filename": "14-Angled abut2.tif",
      "category": "Prosthetics Options - Stock Abutments",
      "title": "Angled Abutments - Dimensions Table",
      "products": [
        {
          "name": "Angled Abutment 15° - Yellow (Fixture Ø3.4)",
          "description": "Used to make up for the direction of the fixture place. Connect it using 1.2 hexa driver (25N-cm)",
          "specifications": ["Fixture Diameter Ø3.4", "Angle: A15°", "Cuff heights: 1, 2, 3, 4"],
          "features": [],
          "partNumbers": ["MISAY 4511S", "MISAY 4521S", "MISAY 4531S", "MISAY 4041S"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Angled Abutment 25° - Yellow (Fixture Ø3.4)",
          "description": "Used to make up for the direction of the fixture place. Connect it using 1.2 hexa driver (25N-cm)",
          "specifications": ["Fixture Diameter Ø3.4", "Angle: A25°", "Cuff heights: 1, 2, 3, 4"],
          "features": [],
          "partNumbers": ["MISAY 4512S", "MISAY 4522S", "MISAY 4832S", "MISAY 4542S"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Angled Abutment 15° - Blue (Fixture Ø4.3)",
          "description": "Used to make up for the direction of the fixture place. Connect it using 1.2 hexa driver (25N-cm)",
          "specifications": ["Fixture Diameter Ø4.3", "Angle: A15°", "Cuff heights: 1, 2, 3, 4"],
          "features": [],
          "partNumbers": ["MISAB 4511S", "MISAB 4521S", "MISAB 4531S", "MISAB 4541S"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        },
        {
          "name": "Angled Abutment 25° - Blue (Fixture Ø4.3)",
          "description": "Used to make up for the direction of the fixture place. Connect it using 1.2 hexa driver (25N-cm)",
          "specifications": ["Fixture Diameter Ø4.3", "Angle: A25°", "Cuff heights: 1, 2, 3, 4"],
          "features": [],
          "partNumbers": ["MISAB 4512S", "MISAB 4522S", "MISAB 4532S", "MISAB 4542S"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        }
      ],
      "additionalInfo": "Diameter D-Ø4.5 for both fixture sizes. Page marked as P1"
    },
    {
      "pageNumber": 15,
      "filename": "15-Temp.tif",
      "category": "Prosthetics Options - Temporary",
      "title": "TEMPORARY ABUTMENTS - Seamless Design, Perfected Sound",
      "products": [],
      "additionalInfo": "Cover page for temporary abutments section with artistic musician theme"
    },
    {
      "pageNumber": 16,
      "filename": "16-Temporary Abut1.tif",
      "category": "Prosthetics Options - Temporary",
      "title": "Temporary Abutments",
      "products": [
        {
          "name": "MGM Temporary Abutment",
          "description": "MGM temporary abutment is a short-term component used in dental implants to support a provisional (temporary) restoration during the healing or integration period before placing the final crown, bridge, or denture.",
          "specifications": [],
          "features": [
            "Purpose: Supports a temporary crown or bridge while the implant site heals and the soft tissue shapes around it",
            "Materials: Often made from titanium, PEEK (polyetheretherketone), or plastic – materials that are easy to adjust and biocompatible",
            "Adjustable: Can be trimmed, shaped, or modified to fit the provisional restoration",
            "Connection: Screwed into the implant like a regular abutment",
            "Duration: Meant for short-term use – typically weeks to a few months"
          ],
          "partNumbers": [],
          "materials": ["Titanium", "PEEK (polyetheretherketone)", "Plastic"],
          "compatibleWith": [],
          "whenToUse": [
            "Immediate loading cases (e.g., a same-day temporary crown)",
            "To shape the soft tissue and emergence profile before placing the final prosthesis",
            "While waiting for final prosthesis fabrication",
            "In esthetic zones (like front teeth) where appearance is important during healing"
          ],
          "types": [
            {
              "name": "Titanium Type",
              "useCase": "More durable, used when function is needed"
            },
            {
              "name": "PEEK/Plastic Type",
              "useCase": "Easier to adjust, often used in esthetic zones"
            }
          ]
        }
      ],
      "additionalInfo": "Key Features of MGM Straight Abutment detailed. Page marked as P1"
    },
    {
      "pageNumber": 17,
      "filename": "17-Healing Abut.tif",
      "category": "Prosthetics Options - Stock Abutments",
      "title": "Healing Abutments",
      "products": [
        {
          "name": "MGM Healing Abutment",
          "description": "MGM Healing abutments (also known as healing cuffs or gingival formers) are temporary components used in dental implantology during the healing phase after implant placement. Their primary role is to guide the healing of the surrounding gum tissue (gingiva) and shape it to ensure a proper emergence profile for the final prosthetic (crown, bridge, or denture).",
          "specifications": [],
          "features": [
            "Soft Tissue Shaping - Helps sculpt the gingiva around the implant site to create a natural-looking contour",
            "Access for Prosthetic Phase - Keeps the implant accessible for the next stage of prosthetic treatment (e.g., impression taking, final abutment placement)",
            "Protection of the implant - Covers the implant platform, protecting it from debris, plaque, and trauma during healing"
          ],
          "partNumbers": [],
          "materials": [],
          "compatibleWith": [],
          "whenPlaced": [
            {
              "timing": "Two-stage surgery",
              "description": "Placed after the implant has osseointegrated (second surgery). Healing abutment is placed simultaneously with the implant, avoiding a second surgery"
            },
            {
              "timing": "One-stage surgery",
              "description": "Healing abutments are placed simultaneously with the implant, avoiding a second surgery"
            },
            {
              "timing": "Immediate Loading Protocols",
              "description": "Sometimes used in conjunction with immediate temporary restorations"
            }
          ],
          "clinicalConsiderations": [
            "Correct height and diameter selection are crucial to avoid soft tissue impingement or inadequate gingival shaping",
            "Should be placed with proper torque values (usually 10–15 Ncm)",
            "Healing time varies from 2 to 4 weeks, depending on tissue response and clinical protocol"
          ],
          "nextSteps": [
            "1. Remove healing abutment",
            "2. Place final prosthetic abutment",
            "3. Take impressions (analog or digital scanning)",
            "4. Fabricate and deliver final Restoration"
          ]
        }
      ],
      "additionalInfo": "Key Functions of Healing Abutments detailed. Page marked as P1"
    },
    {
      "pageNumber": 18,
      "filename": "18-Healing Abut 2.tif",
      "category": "Prosthetics Options - Stock Abutments",
      "title": "Healing Abutments - Dimensions Table",
      "products": [
        {
          "name": "Healing Abutment - Yellow (Fixture Ø3.4)",
          "description": "Forming gingival shape after osseointegration. Tighten it by using 1.2 Hexa Driver and Torque Ratchet (5N10-N).",
          "specifications": ["Fixture Diameter Ø3.4", "Diameter D-Ø4.5", "Cuff heights: 1, 2, 3, 4, 5"],
          "features": [],
          "partNumbers": ["MHLY 4501", "MHLY 4502", "MHLY 4503", "MHLY 4504", "MHLY 4505"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Healing Abutment - Yellow (Fixture Ø3.4)",
          "description": "Forming gingival shape after osseointegration. Tighten it by using 1.2 Hexa Driver and Torque Ratchet (5N10-N).",
          "specifications": ["Fixture Diameter Ø3.4", "Diameter D-Ø5.5", "Cuff heights: 1, 2, 3, 4, 5"],
          "features": [],
          "partNumbers": ["MHLY 5501", "MHLY 5502", "MHLY 5503", "MHLY 5504", "MHLY 5505"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Healing Abutment - Blue (Fixture Ø4.3)",
          "description": "Forming gingival shape after osseointegration. Tighten it by using 1.2 Hexa Driver and Torque Ratchet (5N10-N).",
          "specifications": ["Fixture Diameter Ø4.3", "Diameter D-Ø4.5", "Cuff heights: 1, 2, 3, 4, 5"],
          "features": [],
          "partNumbers": ["MHLB 4501", "MHLB 4502", "MHLB 4503", "MHLB 4504", "MHLB 4505"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        },
        {
          "name": "Healing Abutment - Blue (Fixture Ø4.3)",
          "description": "Forming gingival shape after osseointegration. Tighten it by using 1.2 Hexa Driver and Torque Ratchet (5N10-N).",
          "specifications": ["Fixture Diameter Ø4.3", "Diameter D-Ø5.5", "Cuff heights: 1, 2, 3, 4, 5"],
          "features": [],
          "partNumbers": ["MHLB 5501", "MHLB 5502", "MHLB 5503", "MHLB 5504", "MHLB 5505"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 19,
      "filename": "19-mua.tif",
      "category": "Prosthetics Options - Special",
      "title": "MUA ABUTMENTS - Innovation in Every Note, Art in Every Beat",
      "products": [],
      "additionalInfo": "Cover page for MUA (Multi-Unit Abutments) section with artistic guitar theme"
    },
    {
      "pageNumber": 20,
      "filename": "20-Mua 2-1.tif",
      "category": "Prosthetics Options - Special",
      "title": "MULTI-UNIT Abutments - Dimensions Table",
      "products": [
        {
          "name": "Multi-Unit Abutment - Yellow (Fixture Ø3.4)",
          "description": "Used in screw type prosthetics in multiple cases.",
          "specifications": ["Fixture Diameter Ø3.4", "Diameter D-Ø4.5", "Cuff heights: 1.5, 3, 4.5"],
          "features": [],
          "partNumbers": ["MMUHY 4515", "MMUHY 4530", "MMUHY 4545"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Multi-Unit Abutment - Blue (Fixture Ø4.3)",
          "description": "Used in screw type prosthetics in multiple cases.",
          "specifications": ["Fixture Diameter Ø4.3", "Diameter D-Ø4.5", "Cuff heights: 1.5, 3, 4.5"],
          "features": [],
          "partNumbers": ["MMUHB 4515", "MMUHB 4530", "MMUHB 4545"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 21,
      "filename": "21-Mua 2-2.tif",
      "category": "Prosthetics Options - Special",
      "title": "MU-Angled Abutments - Dimensions Table",
      "products": [
        {
          "name": "MU-Angled Abutment 17°/HEX - Yellow (Fixture Ø3.4)",
          "description": "Used in screw type prosthetics in multiple cases.",
          "specifications": ["Fixture Diameter Ø3.4", "Diameter D-Ø4.5", "Cuff heights: 1.5, 3, 4.5"],
          "features": [],
          "partNumbers": ["MMUAYH 451517", "MMUABH 453017", "MMUABH 454517"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "MU-Angled Abutment 30°/HEX - Yellow (Fixture Ø3.4)",
          "description": "Used in screw type prosthetics in multiple cases.",
          "specifications": ["Fixture Diameter Ø3.4", "Diameter D-Ø4.5", "Cuff heights: 3, 4.5"],
          "features": [],
          "partNumbers": ["MMUABH 453030", "MMUABH 454530"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "MU-Angled Abutment 17°/HEX - Blue (Fixture Ø4.3)",
          "description": "Used in screw type prosthetics in multiple cases.",
          "specifications": ["Fixture Diameter Ø4.3", "Diameter D-Ø4.5", "Cuff heights: 1.5, 3, 4.5"],
          "features": [],
          "partNumbers": ["MMUABH 451517", "MMUABH 453017", "MMUABH 454517"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        },
        {
          "name": "MU-Angled Abutment 30°/HEX - Blue (Fixture Ø4.3)",
          "description": "Used in screw type prosthetics in multiple cases.",
          "specifications": ["Fixture Diameter Ø4.3", "Diameter D-Ø4.5", "Cuff heights: 3, 4.5"],
          "features": [],
          "partNumbers": ["MMUABH 453030", "MMUABH 454530"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 22,
      "filename": "22-special solutions.tif",
      "category": "Prosthetics Options - Special",
      "title": "SPECIAL SOLUTIONS - The Art of Sound, Powered by Precision Engineering",
      "products": [],
      "additionalInfo": "Cover page for special solutions section with artistic piano theme"
    },
    {
      "pageNumber": 23,
      "filename": "23-locator.tif",
      "category": "Prosthetics Options - Special",
      "title": "Locator Abutments",
      "products": [
        {
          "name": "MGM Locator Abutment",
          "description": "MGM Locator abutments are one of the most popular attachment systems used for implant-retained overdentures. They provide a low-profile locking, and highly retentive way to attach removable dentures to implants while still allowing easy insertion and removal by the patient.",
          "specifications": [],
          "features": [
            "Self-Aligning - Easier for patients to seat the denture correctly, even with limited dexterity",
            "Low Profile - Ideal for patients with limited interarch space",
            "Dual Retention - Inner and outer retention surfaces enhance stability",
            "Interchangeable inserts - Different colors = different retention strengths (e.g., blue = light, pink = regular, clear = extra strong)",
            "Angulation correction - Specialized Locator Extended Range abutments can compensate for up to 40° of implant divergence",
            "Excellent retention and stability",
            "Easy maintenance and part replacement",
            "Widely used and well-documented system",
            "Good for both parallel and non-parallel implants"
          ],
          "partNumbers": [],
          "materials": [],
          "compatibleWith": [],
          "advantages": [
            "Excellent retention and stability",
            "Easy maintenance and part replacement",
            "Widely used and well-documented system",
            "Good for both parallel and non-parallel implants"
          ],
          "limitations": [
            "Requires regular maintenance by a dentist",
            "Inserts wear out over time (usually every 6–12 months)",
            "May loosen with heavy bite forces if improperly seated"
          ],
          "whatIsIt": "A Locator abutment is a male component that screws into a dental implant. The nylon insert 'snaps' over the Locator abutment and holds the denture in place. The female component (nylon retention insert) sits inside a metal housing embedded in the denture."
        }
      ],
      "additionalInfo": "Key Features of MGM Locator Abutment detailed. Page marked as P1"
    },
    {
      "pageNumber": 24,
      "filename": "24-locator 2.tif",
      "category": "Prosthetics Options - Special",
      "title": "Locator Abutments - Dimensions Table",
      "products": [
        {
          "name": "Locator Abutment - Yellow (Fixture Ø3.4)",
          "description": "Locator abutment for fixture diameter Ø3.4",
          "specifications": ["Fixture Diameter Ø3.4", "Cuff heights: 1, 2, 3, 4, 5"],
          "features": [],
          "partNumbers": ["MGMY-LA001", "MGMY-LA002", "MGMY-LA003", "MGMY-LA004", "MGMY-LA005"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Locator Abutment - Blue (Fixture Ø4.3)",
          "description": "Locator abutment for fixture diameter Ø4.3",
          "specifications": ["Fixture Diameter Ø4.3", "Cuff heights: 1, 2, 3, 4, 5"],
          "features": [],
          "partNumbers": ["MGMB-LA001", "MGMB-LA002", "MGMB-LA003", "MGMB-LA004", "MGMB-LA005"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        },
        {
          "name": "Ball Abutment Plastic Cap",
          "description": "Plastic cap for ball abutment",
          "specifications": [],
          "features": [],
          "partNumbers": ["MGMBAWP", "MGMBAPP"],
          "materials": ["Plastic"],
          "compatibleWith": []
        },
        {
          "name": "Ball Abutment Stell Cap",
          "description": "Steel cap for ball abutment",
          "specifications": [],
          "features": [],
          "partNumbers": ["MGMBAH"],
          "materials": ["Steel"],
          "compatibleWith": []
        }
      ],
      "additionalInfo": "Page includes Ball Abutment accessories. Page marked as P1"
    },
    {
      "pageNumber": 25,
      "filename": "25-locator 3.tif",
      "category": "Prosthetics Options - Special",
      "title": "Locator Abutments - Peripherals",
      "products": [
        {
          "name": "M-L Abutment Plastic Cap",
          "description": "Plastic cap for M-L abutment",
          "specifications": [],
          "features": [],
          "partNumbers": ["MGMLCP"],
          "materials": ["Plastic"],
          "compatibleWith": []
        },
        {
          "name": "M-L Abutment Steel Cap",
          "description": "Steel cap for M-L abutment - available in multiple colors",
          "specifications": [],
          "features": [],
          "partNumbers": ["MGMLC"],
          "materials": ["Steel"],
          "compatibleWith": []
        },
        {
          "name": "M-L Abutment Analog",
          "description": "Analog for M-L abutment",
          "specifications": [],
          "features": [],
          "partNumbers": ["MGMLA"],
          "materials": [],
          "compatibleWith": []
        },
        {
          "name": "M-L Abut. Impression Coping",
          "description": "Impression coping for M-L abutment",
          "specifications": [],
          "features": [],
          "partNumbers": ["MGMLIC"],
          "materials": [],
          "compatibleWith": []
        }
      ],
      "additionalInfo": "Peripherals for Locator Abutments. Page marked as P1"
    },
    {
      "pageNumber": 26,
      "filename": "26-Ball-socket.tif",
      "category": "Prosthetics Options - Special",
      "title": "Ball - Socket Abutments",
      "products": [
        {
          "name": "MGM Ball-Socket Abutment",
          "description": "MGM Ball and socket abutments are a type of implant abutment system primarily used to retain removable over dentures. They provide a press-fit attachment that allows the denture to 'snap' onto the implants securely while still being removable by the patient. This system works like a press-fit, similar to a snap button.",
          "specifications": [],
          "features": [
            "Use Case: For implant-retained over dentures (commonly lower jaw)",
            "Removable: Designed for daily removal by the patient for cleaning and hygiene",
            "Low Profile: Good option when vertical space is limited",
            "Retention: O-rings provide varying levels of retention force, which can be changed as they wear out",
            "Material: Typically titanium for the ball abutment; housings are metal with replaceable nylon O-rings"
          ],
          "partNumbers": [],
          "materials": ["Titanium", "Metal housings with replaceable nylon O-rings"],
          "compatibleWith": [],
          "advantages": [],
          "limitations": [
            "Less retention than some other systems",
            "O-rings can wear out over time (typically every 6–12 months)",
            "Not ideal for non-parallel implants—locator abutments work better in those cases"
          ]
        }
      ],
      "additionalInfo": "Key Features of MGM Ball-Socket Abutment detailed. Page marked as P1"
    },
    {
      "pageNumber": 27,
      "filename": "27-Ball-socket 2.tif",
      "category": "Prosthetics Options - Special",
      "title": "Ball - Socket Abutments - Dimensions Table",
      "products": [
        {
          "name": "Ball-Socket Abutment - Yellow (Fixture Ø3.4)",
          "description": "Ball-socket abutment for fixture diameter Ø3.4",
          "specifications": ["Fixture Diameter Ø3.4", "Cuff heights: 1, 2, 3, 4, 5"],
          "features": [],
          "partNumbers": ["MGMY-BA001", "MGMY-BA002", "MGMY-BA003", "MGMY-BA004", "MGMY-BA005"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Ball-Socket Abutment - Blue (Fixture Ø4.3)",
          "description": "Ball-socket abutment for fixture diameter Ø4.3",
          "specifications": ["Fixture Diameter Ø4.3", "Cuff heights: 1, 2, 3, 4, 5"],
          "features": [],
          "partNumbers": ["MGMB-BA001", "MGMB-BA002", "MGMB-BA003", "MGMB-BA004", "MGMB-BA005"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        },
        {
          "name": "Ball Abutment Plastic Cap",
          "description": "Plastic cap for ball abutment",
          "specifications": [],
          "features": [],
          "partNumbers": ["MGMBAWP", "MGMBAPP"],
          "materials": ["Plastic"],
          "compatibleWith": []
        },
        {
          "name": "Ball Abutment Stell Cap",
          "description": "Steel cap for ball abutment",
          "specifications": [],
          "features": [],
          "partNumbers": ["MGMBAH"],
          "materials": ["Steel"],
          "compatibleWith": []
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 28,
      "filename": "28-Digital workflow.tif",
      "category": "Prosthetics Options - Digital",
      "title": "DIGITAL WORKFLOW - Fluid Music, Engineered for Excellence",
      "products": [],
      "additionalInfo": "Cover page for digital workflow section with artistic drums theme"
    },
    {
      "pageNumber": 29,
      "filename": "29-Ti base.tif",
      "category": "Prosthetics Options - Digital",
      "title": "Ti-Base Abutments",
      "products": [
        {
          "name": "MGM Ti-Base Abutment",
          "description": "MGM Ti-base (short for titanium base) is a hybrid implant abutment component used in CAD/CAM workflows to support custom zirconia or ceramic restorations on dental implants. It combines the precision and strength of titanium at the implant connection with the esthetic and customizable nature of a digitally milled crown or abutment.",
          "specifications": [],
          "features": [
            "Versatility - Can be used for single units, bridges, and even full-arch cases",
            "Implant Connection - Machined titanium for precise fit and mechanical strength",
            "Customizable Coronal Part - The upper part is designed in CAD software and milled (usually zirconia)",
            "Cemented Extraorally - The zirconia or ceramic part is bonded to the Ti-base outside the mouth, then the full piece is screwed into the implant"
          ],
          "partNumbers": [],
          "materials": ["Titanium", "Zirconia", "Ceramic"],
          "compatibleWith": [],
          "advantages": [
            "Screw-retained, so retrievable if needed",
            "Strong implant connection thanks to titanium base",
            "Ideal for digital dentistry and CAD/CAM workflows",
            "Customizable esthetics using zirconia or other ceramics",
            "Reduces risk of misfit or cement-related peri-implantitis since bonding is done outside the mouth"
          ],
          "limitations": [
            "Requires digital design and milling equipment",
            "Extraoral bonding step must be precise to avoid debonding",
            "Not ideal in situations with extreme angulation (angled screw channels may be needed)"
          ],
          "whatIsIt": "A prefabricated titanium interface that fits directly into the implant. Designed to be bonded to a custom-milled zirconia or ceramic component, such as: A screw-retained abutment, A screw-retained crown, A hybrid abutment crown"
        }
      ],
      "additionalInfo": "Key Features of MGM Ti-Base Abutment detailed. Page marked as P1"
    },
    {
      "pageNumber": 30,
      "filename": "30-Ti-base 2.tif",
      "category": "Prosthetics Options - Digital",
      "title": "Ti-Base Abutments - Dimensions Table",
      "products": [
        {
          "name": "Ti-Base HEX (Fixture Ø3.4 & Ø3.8)",
          "description": "Titanium base with HEX connection",
          "specifications": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"],
          "features": [],
          "partNumbers": ["MGMTY"],
          "materials": ["Titanium"],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Ti-Base HEX (Fixture Ø4.3 & Ø4.8)",
          "description": "Titanium base with HEX connection",
          "specifications": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"],
          "features": [],
          "partNumbers": ["MGMTB"],
          "materials": ["Titanium"],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        },
        {
          "name": "Ti-Base NON-HEX (Fixture Ø3.4 & Ø3.8)",
          "description": "Titanium base without HEX connection",
          "specifications": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"],
          "features": [],
          "partNumbers": ["MGMTNY"],
          "materials": ["Titanium"],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Ti-Base NON-HEX (Fixture Ø4.3 & Ø4.8)",
          "description": "Titanium base without HEX connection",
          "specifications": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"],
          "features": [],
          "partNumbers": ["MGMTNB"],
          "materials": ["Titanium"],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 31,
      "filename": "31-Regular tbase.tif",
      "category": "Prosthetics Options - Digital",
      "title": "REGULAR T-BASE",
      "products": [
        {
          "name": "Regular T-Base (Straight)",
          "description": "A straight titanium base used as a bonding interface between the implant and the final restoration (zirconia, ceramic, etc.).",
          "specifications": [],
          "features": [
            "Screw channel: Straight and vertical (in line with implant axis)",
            "Connection: Hex/conical interface with the implant",
            "Use case: Ideal implant position — screw access hole emerges correctly (usually in the occlusal surface)",
            "Driver: Uses a straight screwdriver",
            "Restoration: Simple cementation or screw-retained crown"
          ],
          "partNumbers": [],
          "materials": ["Titanium"],
          "compatibleWith": [],
          "advantages": [
            "Strong, simple, and reliable",
            "Lower cost and universally compatible with most systems",
            "Ideal for posterior or well-aligned anterior implants"
          ],
          "limitations": [
            "Not suitable for implants with poor angulation (screw access may exit buccally or facially)"
          ]
        },
        {
          "name": "Angled T-Base (Variable or Angulated Titanium Base)",
          "description": "A modified T-base that allows the screw channel to be angled relative to the implant axis (usually 15°–30°).",
          "specifications": [],
          "features": [
            "Screw channel: Angled, allowing redirection in X or Y planes",
            "Internal geometry: Designed to work with angled screws and drivers",
            "Use case: Non-ideal implant positioning — lets you reposition screw access lingually or palatally for esthetics",
            "Useful in anterior regions and multi-unit cases"
          ],
          "partNumbers": [],
          "materials": ["Titanium"],
          "compatibleWith": [],
          "advantages": [
            "Corrects non-ideal implant angulation",
            "Improves esthetics (moves screw access hole off facial surface)",
            "Useful in anterior regions and multi-unit cases"
          ],
          "limitations": [
            "Requires special angled screw system and CAD/CAM library support",
            "Slightly more complex and expensive"
          ]
        }
      ],
      "additionalInfo": "Key Features detailed. Page marked as P1"
    },
    {
      "pageNumber": 32,
      "filename": "32-Regular tbase2.tif",
      "category": "Prosthetics Options - Digital",
      "title": "REGULAR T-BASE - Types and Dimensions",
      "products": [
        {
          "name": "Hexed T-Base",
          "description": "Single implant use, Anti-rotation, Ensures crown stability",
          "specifications": [],
          "features": [],
          "partNumbers": ["MGMTNY15", "MGMTNB15", "MGMTNY30", "MGMTNB30", "MGMTHB15", "MGMTHB30", "MGMTNB15"],
          "materials": [],
          "compatibleWith": []
        },
        {
          "name": "Non-hexed T-Base",
          "description": "Multi-unit use, Allows rotational freedom, Supports passive fit for bridges or frameworks",
          "specifications": [],
          "features": [],
          "partNumbers": ["MGMTNY15", "MGMTNB15", "MGMTNY30", "MGMTHB30"],
          "materials": [],
          "compatibleWith": []
        },
        {
          "name": "MUA T-Base",
          "description": "Titanium bonding base used on top of a Multi-Unit Abutment. Usually non-hexed (to allow passive fit in bridges). Non-hexed (to allow passive fit). Used in CAD/CAM frameworks for screw-retained multi-unit restorations. Ensures metal-to-metal connection, strength, and retrievability.",
          "specifications": [],
          "features": [],
          "partNumbers": [],
          "materials": ["Titanium"],
          "compatibleWith": [],
          "commonWorkflow": "Digital (CAD/CAM), Traditional or digital frameworks"
        }
      ],
      "additionalInfo": "Types: Hexed T-Base vs. Non-Hexed MUA Cylinders. Page marked as P1"
    },
    {
      "pageNumber": 33,
      "filename": "33-PRI-Milled.tif",
      "category": "Prosthetics Options - Digital",
      "title": "PRI-Milled Abutments",
      "products": [
        {
          "name": "MGM PRI-Milled Abutment",
          "description": "MGM Pre-milled abutment (often called PRI-milled abutment) refers to a partially manufactured abutment blank that is designed for customization using CAD/CAM milling systems. It allows dentists or milling centers to create custom abutments with high precision while ensuring that the critical part (the part that fits into the implant) remains accurate and manufacturer-approved.",
          "specifications": [],
          "features": [
            "Screw-Retained - Typically used with a screw for fixation to the implant",
            "Pre-manufactured connection - Ensures perfect fit with implant (maintains manufacturer's specifications)",
            "Customizable shape - The emergence profile, margin, and angle are designed specifically for the patient's case",
            "CAD/CAM workflow - Requires digital design software (e.g., Exocad, 3Shape) and a compatible milling unit"
          ],
          "partNumbers": [],
          "materials": ["Titanium", "Zirconia"],
          "compatibleWith": [],
          "advantages": [],
          "considerations": [
            "Requires CAD/CAM infrastructure and trained lab support",
            "More time and cost-intensive than standard stock abutments",
            "Must use manufacturer-approved blanks for warranty and compatibility"
          ],
          "whatIsIt": "Common in custom titanium or zirconia abutments. The coronal portion (above the gum line) is left blank and customizable. A metal blank with a pre-fabricated implant connection (the part that connects to the implant). Designed to be placed in a milling machine, which mills a custom abutment based on the patient's digital scan or model."
        }
      ],
      "additionalInfo": "Key Features of MGM PRI-Milled Abutment detailed. Page marked as P1"
    },
    {
      "pageNumber": 34,
      "filename": "34-PRI-Milled 2.tif",
      "category": "Prosthetics Options - Digital",
      "title": "PRI-Milled Abutments - Dimensions Table",
      "products": [
        {
          "name": "PRI-Milled Abutment - Yellow/Blue (Fixture Ø3.4 & Ø3.8)",
          "description": "Pre-milled abutment blank for CAD/CAM customization",
          "specifications": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"],
          "features": [],
          "partNumbers": ["MGMPMY"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "PRI-Milled Abutment - Yellow/Blue (Fixture Ø4.3 & Ø4.8)",
          "description": "Pre-milled abutment blank for CAD/CAM customization",
          "specifications": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"],
          "features": [],
          "partNumbers": ["MGMPMB"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 35,
      "filename": "35-lab workflow.tif",
      "category": "Lab Workflow",
      "title": "LAB WORKFLOW - Harmonizing Technology with the Flow of Music",
      "products": [],
      "additionalInfo": "Cover page for lab workflow section with artistic saxophone theme"
    },
    {
      "pageNumber": 36,
      "filename": "36-tradiotanl lab parts.tif",
      "category": "Lab Workflow",
      "title": "TRADITIONAL LAB PARTS - Sound Sculpted with the Grace of Innovation",
      "products": [],
      "additionalInfo": "Cover page for traditional lab parts section with artistic harp theme"
    },
    {
      "pageNumber": 37,
      "filename": "37-Transfer coping.tif",
      "category": "Lab Workflow - Traditional",
      "title": "Transfer Coping Abutments",
      "products": [
        {
          "name": "MGM Transfer Coping Abutment",
          "description": "MGM transfer coping (also called a transfer impression coping) is a component used during dental impressions to accurately transfer the position and orientation of an implant from the patient's mouth to a dental cast or digital model. It's essential in the process of fabricating precise prosthetic restorations like crowns, bridges, or dentures on implants.",
          "specifications": [],
          "features": [],
          "partNumbers": [],
          "materials": [],
          "compatibleWith": [],
          "types": [
            {
              "name": "MGM Multi-Unit Impression Coping (Opened Type)",
              "description": "Transfers a reusable impression coping that stays embedded in the impression material. Used with a custom open-top tray. Allows for a higher level impression accuracy. Best for multiple implant cases. After the impression is taken, the coping remains embedded in the impression material, allowing the dental lab to replicate the implant position in the analog."
            },
            {
              "name": "MGM Closed-Tray Impression Coping (Pickup Type)",
              "description": "Used with MUA (closed-tray). Coping stays behind. Less accurate than open tray, but more convenient."
            },
            {
              "name": "MGM MUA Impression Transfer Coping",
              "description": "Used with MUA (Multi-Unit Abutment system)"
            }
          ],
          "advantages": [
            "Helps lab fabricate restorations that fit precisely",
            "Ensures accurate model creation for final prosthesis",
            "Comes in different platforms and sizes based on implant system"
          ],
          "considerations": [
            "Must match the specific implant system and platform",
            "Improper seating or handling can lead to misfit restorations",
            "Open-tray technique is more technique-sensitive but more accurate"
          ],
          "whatIsIt": "It captures the exact 3D location, depth, and angulation of the implant in the mouth. A temporary component attached to the implant or abutment during the impression-taking process. After the impression is taken, the coping remains embedded in the impression material, allowing the dental lab to replicate the implant position in the analog."
        }
      ],
      "additionalInfo": "Types of MGM Transfer Copings detailed. Page marked as P1"
    },
    {
      "pageNumber": 38,
      "filename": "38-2Opened tray.tif",
      "category": "Lab Workflow - Traditional",
      "title": "Transfer Coping Abutments - Opened Type Impression Coping - Dimensions Table",
      "products": [
        {
          "name": "Opened Type Impression Coping - Yellow (Fixture Ø3.4)",
          "description": "Used when working cast is designed, and has same inner-connection structure as the fixture. Used with close tray when taking fixture level impression. Used with open type tray when taking fixture level impression. Tighten it by using 1.2 hexa driver and torque ratchet (10N-cm)",
          "specifications": ["Fixture Diameter Ø3.4", "Diameter D-Ø4.5", "Length: 14.9 (Long)"],
          "features": [],
          "partNumbers": ["MICYT45L"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Opened Type Impression Coping - Blue (Fixture Ø4.3)",
          "description": "Used when working cast is designed, and has same inner-connection structure as the fixture. Used with close tray when taking fixture level impression. Used with open type tray when taking fixture level impression. Tighten it by using 1.2 hexa driver and torque ratchet (10N-cm)",
          "specifications": ["Fixture Diameter Ø4.3", "Diameter D-Ø4.5", "Length: 14.9 (Long)"],
          "features": [],
          "partNumbers": ["MICBT45L"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 39,
      "filename": "39-Closed Type.tif",
      "category": "Lab Workflow - Traditional",
      "title": "Transfer Coping Abutments - Closed Type Impression Coping - Dimensions Table",
      "products": [
        {
          "name": "Closed Type Impression Coping - Yellow (Fixture Ø3.4)",
          "description": "Used when working cast is designed, and has same inner-connection structure as the fixture. Used with close tray when taking fixture level impression. Used with open type tray when taking fixture level impression. Tighten it by using 1.2 hexa driver and torque ratchet (10N-cm)",
          "specifications": ["Fixture Diameter Ø3.4", "Diameter D-Ø4.5", "Length: 14.9 (Long)"],
          "features": [],
          "partNumbers": ["MICYT45L"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Closed Type Impression Coping - Blue (Fixture Ø4.3)",
          "description": "Used when working cast is designed, and has same inner-connection structure as the fixture. Used with close tray when taking fixture level impression. Used with open type tray when taking fixture level impression. Tighten it by using 1.2 hexa driver and torque ratchet (10N-cm)",
          "specifications": ["Fixture Diameter Ø4.3", "Diameter D-Ø4.5", "Length: 14.9 (Long)"],
          "features": [],
          "partNumbers": ["MICBT45L"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 40,
      "filename": "40-Analog.tif",
      "category": "Lab Workflow - Traditional",
      "title": "Analog Abutments",
      "products": [
        {
          "name": "MGM Lab Analog / MGM Implant Analog",
          "description": "MGM lab analog or MGM implant analog is a replica of a dental implant or abutment used in the dental laboratory to simulate the position and orientation of an implant within a working model (stone or 3D printed).",
          "specifications": [],
          "features": [
            "Replicates implant position on a dental cast or 3D printed model",
            "Ensures the final restoration fits accurately and passively in the patient's mouth",
            "Allows the lab to build and test-fit prosthetic components (e.g., abutments, crowns)"
          ],
          "partNumbers": [],
          "materials": ["Precision-milled metal or plastic"],
          "compatibleWith": [],
          "types": [
            {
              "name": "Abutment Analog",
              "description": "Replicates an abutment (not the implant itself)"
            },
            {
              "name": "Digital Analog",
              "description": "For digital workflows (STL files for virtual models)"
            },
            {
              "name": "MUA Analog",
              "description": "For Multi-Unit Abutments"
            }
          ],
          "howToUse": [
            "1. A transfer coping is used to take an impression of the implant's position",
            "2. The impression is sent to the lab with the implant analog",
            "3. The analog is attached to the coping inside the impression (in an open-tray model), creating a physical replica of the patient's implant situation",
            "4. A model is poured (or printed) around the analog, creating a physical replica",
            "5. Lab uses the model with analog to fabricate and verify the final restoration"
          ],
          "advantages": [
            "Critical for accurate lab work",
            "Maintains proper angulation and positioning",
            "Compatible with both stone models and digital workflows (some analogs are designed for 3D printed models)"
          ],
          "importantNotes": [
            "Must match the brand, platform, and size of the actual implant used in the patient",
            "If mismatched or incorrectly seated, it can lead to poor prosthetic fit"
          ],
          "whatIsIt": "Used during the laboratory fabrication of implant restorations (crowns, bridges, overdentures). Placed in the working model in the exact location and angulation where the implant sits in the patient's mouth. A precision-milled metal or plastic component that mimics the shape and connection of the actual dental implant."
        }
      ],
      "additionalInfo": "Key Features of MGM Locator Abutment detailed. Page marked as P1"
    },
    {
      "pageNumber": 41,
      "filename": "41-analog 2.tif",
      "category": "Lab Workflow - Traditional",
      "title": "Analog Abutments - Dimensions Table",
      "products": [
        {
          "name": "Analog Abutment - Yellow (Fixture Ø3.4)",
          "description": "Designed to replicate the exact position and exact external and internal anatomy of chosen implant for the laboratory.",
          "specifications": ["Fixture Diameter Ø3.4", "Diameter D-Ø4.5"],
          "features": [],
          "partNumbers": ["MLAY 3401"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Analog Abutment - Blue (Fixture Ø4.3)",
          "description": "Designed to replicate the exact position and exact external and internal anatomy of chosen implant for the laboratory.",
          "specifications": ["Fixture Diameter Ø4.3", "Diameter D-Ø4.5"],
          "features": [],
          "partNumbers": ["MLAB 4301"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 42,
      "filename": "42-Digital lab pars.tif",
      "category": "Lab Workflow - Digital",
      "title": "DIGITAL LAB PARTS - Where Technology Transforms Sound into A Timeless Melody",
      "products": [],
      "additionalInfo": "Cover page for digital lab parts section with artistic saxophone theme"
    },
    {
      "pageNumber": 43,
      "filename": "43-Scan Body.tif",
      "category": "Lab Workflow - Digital",
      "title": "Scan Body Abutments",
      "products": [
        {
          "name": "MGM Scan Body Abutment",
          "description": "MGM scan body is a digital impression component used in implant dentistry to capture the exact position, angulation, and orientation of a dental implant or abutment during an intraoral screw-in scan. It is essential in digital implant workflows for designing accurate, custom restorations using CAD/CAM technology.",
          "specifications": [],
          "features": [
            "Custom shape - Unique geometry (flats, grooves, notches) allows the software to identify it easily",
            "Exact alignment - Translates the 3D position and rotation of the implant into the digital model",
            "Attachable - Screws into the implant or abutment, like a healing abutment",
            "Digital library match - Must match the implant brand and platform exactly for proper recognition in the CAD software"
          ],
          "partNumbers": [],
          "materials": ["PEEK", "Titanium"],
          "compatibleWith": [],
          "howToUse": [
            "1. The scan body is screwed onto the implant in the mouth (or onto a lab analog in a printed/model scan)",
            "2. A 3D intraoral scanner (or lab scanner) captures images with the scan body in place",
            "3. The scanner captures the geometry of the scan body",
            "4. The CAD software uses the scan body data to precisely position the implant into the scan with precise orientation and depth",
            "5. A custom abutment or crown is designed based on this data"
          ],
          "advantages": [
            "Speeds up the implant restoration process",
            "Allows for fully digital workflows",
            "Highly accurate for single implants",
            "No need for messy impression materials",
            "Ideal for CAD/CAM custom abutments and crowns"
          ],
          "considerations": [
            "Must match the implant system exactly (manufacturer, platform, diameter)",
            "Proper seating is crucial—even small misfits cause prosthetic errors",
            "May require scan spray if material is too reflective or transparent"
          ],
          "whatIsIt": "A specially shaped component (usually made of PEEK or titanium) that attaches to the implant or abutment during an intraoral scan. It is recognized by CAD software using a digital library to precisely position the implant in a virtual model. Acts like a digital \"transfer partner.\""
        }
      ],
      "additionalInfo": "Key Features of MGM Scan Body Abutment detailed. Page marked as P1"
    },
    {
      "pageNumber": 44,
      "filename": "44-Scan body 2.tif",
      "category": "Lab Workflow - Digital",
      "title": "Scan Body Abutments - Dimensions Table",
      "products": [
        {
          "name": "Implants Scan Body (Fixture Ø3.4 & Ø3.8)",
          "description": "Scan body for regular implants",
          "specifications": ["Diameter D-Ø3.4", "Diameter D-Ø3.8"],
          "features": [],
          "partNumbers": ["MGMSY"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø3.4", "Fixture Diameter Ø3.8"]
        },
        {
          "name": "Implants Scan Body (Fixture Ø4.3 & Ø4.8)",
          "description": "Scan body for regular implants",
          "specifications": ["Diameter D-Ø4.3", "Diameter D-Ø4.8"],
          "features": [],
          "partNumbers": ["MGMSB"],
          "materials": [],
          "compatibleWith": ["Fixture Diameter Ø4.3", "Fixture Diameter Ø4.8"]
        },
        {
          "name": "MUA Scan Body",
          "description": "Scan body for Multi-Unit Abutments",
          "specifications": [],
          "features": [],
          "partNumbers": ["MGMMUSY", "MGMMUSB"],
          "materials": [],
          "compatibleWith": ["Multi-Unit Abutments"]
        }
      ],
      "additionalInfo": "Page marked as P1"
    },
    {
      "pageNumber": 45,
      "filename": "45-analog3.tif",
      "category": "Lab Workflow - Digital",
      "title": "Analog Abutments - Peripherals",
      "products": [
        {
          "name": "Multi Unit Lab Analog",
          "description": "Replacement of abutment shape in cast model.",
          "specifications": ["Diameter D-Ø4.5"],
          "features": [],
          "partNumbers": ["MULAN45"],
          "materials": [],
          "compatibleWith": []
        },
        {
          "name": "Multi Unit Lab Analog (Hexed)",
          "description": "Replacement of abutment shape in cast model - hexed version.",
          "specifications": ["Diameter D-Ø4.5"],
          "features": [],
          "partNumbers": ["MULAH45"],
          "materials": [],
          "compatibleWith": []
        },
        {
          "name": "Multi Unit Digital Analog",
          "description": "Digital analog for Multi-Unit Abutments",
          "specifications": ["Diameter D-Ø4.5"],
          "features": [],
          "partNumbers": ["MGMMUDA"],
          "materials": [],
          "compatibleWith": []
        }
      ],
      "additionalInfo": "Peripherals for Analog Abutments. Page marked as P1"
    },
    {
      "pageNumber": 46,
      "filename": "46-MU Cylinders.tif",
      "category": "Lab Workflow - Special",
      "title": "MULTI-UNIT Cylinders",
      "products": [
        {
          "name": "MUA Cylinders",
          "description": "MUA cylinders (also called multi-unit abutment cylinders or coping cylinders) are prosthetic components that connect directly to the MUA. They serve as the interface between the MUA and the final prosthesis, providing the structure that the lab or CAD/CAM system uses to create the restoration.",
          "specifications": [],
          "features": [],
          "partNumbers": [],
          "materials": ["PEEK", "Plastic (for provisional restorations or casting)", "Titanium (for final prostheses)"],
          "compatibleWith": ["Multi-Unit Abutments"],
          "types": [
            {
              "name": "Temporary (or Titanium Cylinder)",
              "materials": "PEEK or burn-out plastic",
              "useCase": "For provisional restorations or casting. Can be modified, cut, or cast over"
            },
            {
              "name": "Definitive (or Titanium Cylinder)",
              "materials": "Titanium",
              "useCase": "For final prostheses (zirconia, hybrid, metal frameworks). Can be laser welded, bonded, or screwed directly"
            }
          ],
          "hexedVsNonHexed": {
            "hexed": {
              "description": "Feature Hexed Cylinder, Non-Hexed Cylinder",
              "antiRotation": "Has internal hex. No hex allows free rotation",
              "commonUse": "Single-unit restorations. Multi-unit bridges or full-arch",
              "purpose": "Prevents rotation. Enables passive fit across multiple MUAs",
              "compatibility": "Rare with MUA (since MUA is usually non-hexed). Standard for All-on-4, All-on-6, etc."
            },
            "nonHexed": {
              "description": "Feature Hexed Cylinder, Non-Hexed Cylinder",
              "antiRotation": "Has internal hex. No hex allows free rotation",
              "commonUse": "Single-unit restorations. Multi-unit bridges or full-arch",
              "purpose": "Prevents rotation. Enables passive fit across multiple MUAs",
              "compatibility": "Rare with MUA (since MUA is usually non-hexed). Standard for All-on-4, All-on-6, etc."
            }
          },
          "inPractice": "Most MUA cylinders are non-hexed, since MUA restorations are multi-unit (bridges, full arches), and rotational freedom is essential for passive fit and stress-free seating.",
          "keyDifference": "MUA T-Base vs. MUA Cylinder. Feature MUA T-Base MUA Cylinder. Purpose CAD/CAM bonding base for zirconia. Used in cast or milled frameworks. Shape Short, machined base (taller, cylindrical body). Common Workflow Digital (CAD/CAM). Traditional or digital frameworks. Connection Screws onto MUA. Screws onto MUA. Use case Bonded to custom-milled zirconia. Used in cast or milled frameworks for screw-retained multi-unit restorations. Ensures metal-to-metal connection, strength, and retrievability.",
          "commonClinicalUses": [
            "All-on-4 / All-on-6 full-arch bridges",
            "Screw-retained zirconia or hybrid prostheses",
            "Verification jigs and passive fit frameworks",
            "Provisional prostheses (plastic or titanium cylinders)"
          ]
        }
      ],
      "additionalInfo": "Types of MUA Cylinders. Page marked as P1"
    },
    {
      "pageNumber": 47,
      "filename": "47--special lab parts.tif",
      "category": "Lab Workflow - Special",
      "title": "SPECIAL LAB PARTS - Designing the Future of Music with Flawless Engineering",
      "products": [],
      "additionalInfo": "Cover page for special lab parts section with artistic xylophone theme"
    },
    {
      "pageNumber": 48,
      "filename": "48-Mua transfer.tif",
      "category": "Lab Workflow - Special",
      "title": "Transfer Coping Abutments - Multi Unit Impression Coping - Dimensions Table",
      "products": [
        {
          "name": "Multi Unit Impression Coping (Open Tray) - MUICTN45",
          "description": "Pick-up type impression-taking process using custom tray (Open tray). Use with an Open-tray. Use with 1.2 Hexa Driver",
          "specifications": ["Diameter D-Ø4.5"],
          "features": [],
          "partNumbers": ["MUICTN45"],
          "materials": [],
          "compatibleWith": []
        },
        {
          "name": "Multi Unit Impression Coping (Open Tray) - MUICP45",
          "description": "Pick-up type impression-taking process using custom tray (Open tray). Use with an Open-tray. Use with 1.2 Hexa Driver",
          "specifications": ["Diameter D-Ø4.5"],
          "features": [],
          "partNumbers": ["MUICP45"],
          "materials": [],
          "compatibleWith": []
        }
      ],
      "additionalInfo": "Page marked as P1"
    }
  ]
}
